In [68]:
import pandas as pd
import numpy as np

In [69]:
df = pd.read_excel('Category.xlsx')

In [70]:
df.head()

   ArticleId                ArticleName      Category
0        165                 40993 BLUE  SLIP ON SHOE
1        172                40113 BLACK    ANKLE BOOT
2        173           40113 DARK BROWN     HALF BOOT
3        426  4755/110  BRONZE + GOLDEN          Boot
4        533                80936 BLACK  SLIP ON SHOE

In [71]:
df.drop(labels=['ArticleId'],axis=1,inplace=True)

In [72]:
df.head()

                 ArticleName      Category
0                 40993 BLUE  SLIP ON SHOE
1                40113 BLACK    ANKLE BOOT
2           40113 DARK BROWN     HALF BOOT
3  4755/110  BRONZE + GOLDEN          Boot
4                80936 BLACK  SLIP ON SHOE

In [73]:
len(df["Category"].value_counts())

30

In [74]:
df['Category'].value_counts()

SLIP ON SHOE        452
LACE SHOE           391
SLIPPER             207
ANKLE BOOT          147
CASUAL SHOES         91
SANDAL               72
MEN SHOE             62
Boot                 50
LACE UP              48
Slipper              42
SLIP ON              38
Slip-On Sneakers     17
LOAFER               13
FORMAL SHOES         13
TOE GRIP SLIPPER      7
HALF BOOT             7
ROMAN SANDAL          6
MUELS                 4
PUMPS                 4
Lace-Up Shoes         3
BOOTS                 3
Slip-on Sneakers      2
BOOT                  2
Sliders               2
Sneakers              2
SLIPPERS              2
Flip-Flops            2
Monk Shoes            1
Loafers               1
Casual Shoes          1
Name: Category, dtype: int64

In [84]:
def helper(row):
    if(row.Category == 'Slip-on Sneakers'):
        row.Category = 'Slip-On Sneakers'
    if(row.Category == 'Slipper'):
        row.Category = 'SLIPPER'
    if(row.Category == 'Loafers'):
        row.Category = 'LOAFER'
    if(row.Category == 'Slip-on Sneakers'):
        row.Category = 'Slip-On Sneakers'
    if(row.Category == 'BOOT' or row.Category == 'BOOTS'):
        row.Category = 'Boot'
    if(row.Category == 'SLIPPERS'):
        row.Category = 'SLIPPER'
    if(row.Category == 'Casual Shoes'):
        row.Category = 'CASUAL SHOES'
    if(row.Category == 'LACE UP' or row.Category == 'Lace-Up Shoes'):
        row.Category = 'LACE SHOE'
    if(row.Category == 'Slip-On Sneakers' or row.Category == 'SLIP ON'):
        row.Category = 'SLIP ON SHOE'
    return row
df = df.apply(helper,axis='columns')

In [85]:
df['Category'].value_counts()

SLIP ON SHOE        509
LACE SHOE           442
SLIPPER             251
ANKLE BOOT          147
CASUAL SHOES         92
SANDAL               72
MEN SHOE             62
Boot                 55
LOAFER               14
FORMAL SHOES         13
TOE GRIP SLIPPER      7
HALF BOOT             7
ROMAN SANDAL          6
PUMPS                 4
MUELS                 4
Flip-Flops            2
Sneakers              2
Sliders               2
Monk Shoes            1
Name: Category, dtype: int64

In [86]:
len(df['Category'].value_counts())

19